app/views/items/search.html.erb

    <%= label_tag(:q, "Type") %>
    <%= collection_select(:type, :type_id, Type.all, :id, :title) %>
---
SELECT "types".* FROM "types"