app/controllers/items_controller.rb

  def search
    if params[:condition]
      if params[:condition] == "OR"
      @results = Item.where("title LIKE ? OR description LIKE ? OR owner LIKE ? OR type_id = #{params[:type][:type_id]}",
      "%#{params[:title]}%", "%#{params[:description]}%", "%#{params[:owner]}%")
---
SELECT  "items".* FROM "items" WHERE (title LIKE '%java%' AND description LIKE '%%' AND owner LIKE '%%' AND type_id = 13)  ORDER BY "items"."id" ASC LIMIT 1

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "MyString"], ["description", "MyText"], ["created_at", "2015-03-17 01:42:30.991057"], ["updated_at", "2015-03-17 01:42:30.991057"]]